import Article from '@/shared/components/Article'
import ArticleHeading from '@/shared/components/ArticleHeader'
import ArticleParagraph from '@/shared/components/ArticleParagraph'
import Heading_1 from '@/shared/components/Heading_1'
import { IPrivacyPolicy } from '@/shared/types/privacy-policy.types'
import { Metadata } from 'next'

export const metadata: Metadata = {
   title: 'นโยบายคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)',
   description: 'พรรคคนไทย',
}

const privacyPolicies: IPrivacyPolicy[] = [
   {
      id: 1,
      heading: 'คำประกาศความเป็นส่วนตัว',
      paragraphs: [
         'พรรคคนไทยเป็นพรรคการเมืองที่ให้ความสำคัญกับสิทธิในความเป็นส่วนตัวของปัจเจกชนทุกคน จึงกำหนดนโยบายคุ้มครองข้อมูลส่วนบุคคลโดยมีมาตรฐานความปลอดภัยและมาตรฐานการรักษาความลับอย่างเข้มงวด สำหรับผู้ใช้งานเว็บไซต์ของพรรคคนไทย คือ   peoplesparty.or.th ในการนี้ พรรคคนไทยขอเรียนผู้ใช้งานเว็บไซต์ทราบว่า นโยบายนี้มีความสำคัญต่อท่าน และขอให้ท่านในฐานะเจ้าของข้อมูลส่วนบุคคลอ่านนโยบายคุ้มครองข้อมูลส่วนบุคคลดังจะกล่าวต่อไปนี้โดยละเอียด เพื่อให้ความยินยอมการดำเนินการของพรรคคนไทยทั้งหมดหรือบางส่วน หรือไม่ให้ความยินยอม ต่อไป',
      ],
   },
   {
      id: 2,
      heading: '1. การจัดเก็บข้อมูลส่วนบุคคลอย่างจำกัดและเท่าที่จำเป็น',
      paragraphs: [
         'ข้อมูลส่วนบุคคลของข้าพเจ้าที่พรรคได้รับมาจากท่าน เช่น ชื่อ – นามสกุล เลขประจำตัวประชาชน อีเมล (E-mail) หมายเลขโทรศัพท์ หมายเลขโทรสาร วันเดือนปีเกิด อายุ ภูมิลำเนา ถิ่นที่อยู่ เชื้อชาติ ศาสนา เพศ อาชีพ สถานภาพเกี่ยวกับการสมรส อุดมการณ์ทางการเมือง ความคิดเห็นทางการเมือง ประวัติการดำเนินกิจกรรมทางการเมือง ข้อมูลอุปกรณ์หรือเครื่องมือ อาทิ IP address, MAC address, Cookie ID เป็นต้น ข้อมูลบันทึกที่ใช้ติดตามตรวจสอบกิจกรรมต่าง ๆ ของท่าน อาทิ Log File เป็นต้น ข้อมูลบัญชีผู้ใช้งาน (Account) หรือข้อมูลที่ท่านได้แก้ไขปรับปรุงในบัญชีผู้ใช้งานของท่าน  ภาพสำเนาบัตร และ/หรือเอกสาร ที่มีข้อมูลส่วนบุคคล อาทิ ภาพสำเนาบัตรประจำตัวประชาชน, ภาพสำเนาทะเบียนบ้าน, ภาพถ่ายของท่านที่ถ่ายคู่กับบัตรประจำตัวประชาชน เป็นต้น รวมถึงข้อมูลซึ่งสามารถบ่งบอกตัวบุคคลของข้าพเจ้าได้ อันเป็นข้อมูลส่วนบุคคลที่มีความถูกต้อง สมบูรณ์ และเป็นปัจจุบัน พรรคสามารถนำไปใช้ให้เป็นไปตามวัตถุประสงค์ที่กำหนดไว้เท่านั้นโดยรักษาข้อมูลเหล่านั้นไว้เป็นความลับ และพรรคมีหน้าที่ดำเนินมาตรการที่เข้มงวดในการรักษาความมั่นคงปลอดภัย ตลอดจนการป้องกันมิให้มีการนำข้อมูลส่วนบุคคลไปใช้โดยมิได้รับอนุญาตจากข้าพเจ้าก่อน',
      ],
   },
   {
      id: 3,
      heading: '2. คุณภาพของข้อมูลส่วนบุคคล',
      paragraphs: [
         'พรรคสามารถจัดเก็บข้อมูลส่วนบุคคลของข้าพเจ้า เพื่อนำไปใช้ประโยชน์ในการดำเนินงานของพรรค ซึ่งเป็นไปตามขอบเขตและวัตถุประสงค์ในการดำเนินกิจกรรมทางการเมืองของพรรค โดยข้อมูลที่ได้ทำการจัดเก็บนั้น พรรคต้องคำนึงถึงความถูกต้อง ครบถ้วน และความเป็นปัจจุบันของข้อมูล',
      ],
   },
   {
      id: 4,
      heading: '3. วัตถุประสงค์ในการจัดเก็บข้อมูลส่วนบุคคล',
      paragraphs: [
         'ข้าพเจ้ายินยอมให้พรรคทำการเก็บรวบรวม ใช้ ประมวลผล หรือเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้าเพื่อวัตถุประสงค์ดังต่อไปนี้',
         '3.1 ดำเนินการตามวัตถุประสงค์ของพรรคที่กำหนดไว้ในข้อบังคับพรรคคนไทย พ.ศ. 2567 และที่แก้ไขเพิ่มเติม รวมถึงการพัฒนาเว็บไซต์ของระบบงานต่าง ๆ ให้มีความทันสมัย หากภายหลัง พรรคเปลี่ยนแปลงวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล พรรคจะแจ้งให้ข้าพเจ้าทราบและขอความยินยอมโดยตรงหรือขอความยินยอมโดยปริยายจากข้าพเจ้าผ่านทางอีเมล (E-mail) หรือข้อความ SMS ผ่านหมายเลขโทรศัพท์มือถือที่ข้าพเจ้าได้จดแจ้งไว้กับพรรค หรือประกาศไว้ในเว็บไซต์ของพรรคไม่น้อยกว่า 7 วันก่อนวันเริ่มมีผลบังคับใช้ ทั้งนี้ พรรคจะกำหนดให้มีการบันทึกการแก้ไขเพิ่มเติมวัตถุประสงค์ไว้เป็นหลักฐานด้วย',
         '3.2 ดำเนินการเกี่ยวกับการส่งผู้สมัครรับเลือกตั้ง การหาเสียงเลือกตั้ง การประเมินวิธีการดำเนินกิจกรรมทางการเมือง การรณรงค์ทางการเมืองในวิถีทางประชาธิปไตย การสำรวจความคิดเห็น และการระดมทุนของพรรค เป็นต้น',
         '3.3 เผยแพร่ความรู้ความเข้าใจเกี่ยวกับการใช้สิทธิเสรีภาพของราษฎร ขับเคลื่อนการทำงานในทางประชาสังคมเพื่อการพัฒนาประเทศ และการแก้ไขปัญหาต่าง ๆ ที่เกิดขึ้นในสังคม รวมทั้งการตรวจสอบการใช้อำนาจรัฐและการดำเนินงานขององค์กรอิสระ เป็นต้น',
         '3.4 เพื่อเสนอขายสินค้าและบริการของพรรค โดยพรรคสามารถเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้าให้กับบุคคลที่ได้รับมอบหมายจากพรรคเสนอขายสินค้าหรือบริการของพรรคได้',
         '3.5 วิเคราะห์ข้อมูลเพื่อส่งเสริมการดำเนินกิจกรรมทางการเมืองของพรรค และสำรวจความพึงพอใจหรือความคิดเห็นของข้าพเจ้าเพื่อปรับปรุงการดำเนินกิจกรรมทางการเมืองตลอดจนเพื่อกำหนดแนวทางการดำเนินกิจกรรมทางการเมืองของพรรค',
         '3.6 เพื่อการให้บริการธุรกรรมทางอิเล็กทรอนิกส์ของพรรค เช่น การสมัครสมาชิกพรรค การให้บริการรับชำระค่าบริจาคเงินให้แก่พรรค การให้บริการหักบัญชีเงินฝากธนาคารหรือผ่านบัตรเครดิต โดยพรรคจะเก็บข้อมูลส่วนบุคคลของข้าพเจ้า ได้แก่ ชื่อ – นามสกุล ภูมิลำเนา ถิ่นที่อยู่ หมายเลขโทรศัพท์ เลขที่บัญชีเงินฝากธนาคาร บัตรเดบิตหรือบัตรเครดิต ตลอดจนข้อมูลอื่นตามที่ธนาคารหรือผู้ให้บริการคู่สัญญากับพรรคกำหนด อนึ่ง พรรคจะใช้วิธีการทางอิเล็กทรอนิกส์เพื่อการเก็บข้อมูลส่วนบุคคลของข้าพเจ้า ดังนี้',
         '(ก) การใช้คุกกี้ (Cookies) กล่าวคือ เว็บไซต์ของพรรคจะมีการใช้คุกกี้เชื่อมโยงข้อมูลส่วนบุคคลของข้าพเจ้า อันเป็นไฟล์ข้อมูลขนาดเล็กที่จะถูกส่งไปเก็บไว้ยังโปรแกรมค้นดูเว็บไซต์ (Web Browser) ของข้าพเจ้า เพื่อเก็บข้อมูลที่ข้าพเจ้าเข้าเยี่ยมชมไว้ เมื่อข้าพเจ้าได้เยี่ยมชมเว็บไซต์ต่าง ๆ อีกครั้งในภายหลัง โปรแกรมค้นดูเว็บไซต์จะจดจำได้ว่า ข้าพเจ้าเคยเข้าเยี่ยมชมแล้ว จนกว่าข้าพเจ้าจะลบคุกกี้นั้น หรือไม่อนุญาตให้คุกกี้นั้นทำงานอีกต่อไป และพรรคจะบันทึกหรือเก็บรวบรวมไว้ ใช้ และประมวลผลข้อมูลนั้นไปใช้ในการวิเคราะห์เชิงสถิติหรือในกิจกรรมอื่นของพรรค เพื่อปรับปรุงคุณภาพการให้บริการของเว็บไซต์ และการดำเนินกิจกรรมทางการเมืองของพรรคต่อไป',
         '(ข) บันทึกผู้เข้าชมเว็บไซต์ (Log Files) กล่าวคือ การให้บริการของเว็บไซต์ของพรรค จะมีการเก็บบันทึกเข้าออกเว็บไซต์ของข้าพเจ้าโดยอัตโนมัติที่สามารถเชื่อมโยงข้อมูลดังกล่าวกับข้อมูลที่ระบุตัวบุคคลได้ เช่น หมายเลขไอพี (IP Address) เว็บไซต์ที่เข้าออกก่อนและหลัง และประเภทของโปรแกรมบราวเซอร์ (Browser) เป็นต้น ทั้งนี้ เพื่อดำเนินการให้เป็นไปตามหน้าที่ที่กำหนดไว้ตามกฎหมายว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์',
         '(ค) การระบุข้อมูลที่สามารถเลือกว่า “จะให้หรือไม่ให้” ก็ได้ กล่าวคือ พรรคมีการให้บริการทางอิเล็กทรอนิกส์ผ่านทางเว็บไซต์พรรค ซึ่งแบ่งการให้ข้อมูลของข้าพเจ้าเป็น 2 ส่วน คือ ส่วนที่ข้าพเจ้าต้องให้ข้อมูลที่จำเป็นต่อการประมวลผล และการดำเนินการของการใช้บริการนั้น โดยจะระบุด้วยเครื่องหมายดอกจัน (*) และส่วนที่ข้าพเจ้ามีสิทธิเลือกว่า จะให้หรือไม่ให้ข้อมูลก็ได้ กรณีที่ข้าพเจ้าไม่ประสงค์ให้ข้อมูลทั้งหมดผ่านทางเว็บไซต์ ข้าพเจ้าสามารถติดต่อกับพรรคคนไทยผ่านทางหมายเลขโทรศัพท์ของผู้ควบคุมข้อมูล หรือเจ้าหน้าที่ที่เกี่ยวข้องโดยตรง ณ ที่ทำการของพรรค ได้',
         '3.7 เพื่อรับข้อมูลข่าวสาร การโฆษณาประชาสัมพันธ์ แคมเปญ การตลาด จากพรรคเกี่ยวกับการดำเนินการตามข้อ 3.1 ข้อ 3.2 ข้อ 3.3 ข้อ 3.4 ข้อ 3.5 และข้อ 3.6 ของพรรค',
      ],
   },
   {
      id: 5,
      heading: '4. ข้อจำกัดในการนำข้อมูลส่วนบุคคลไปใช้',
      paragraphs: [
         'พรรคจะไม่เปิดเผยข้อมูลส่วนบุคคลที่มีการจัดเก็บรวบรวมไว้ให้กับบุคคลภายนอก และโดยที่พรรคกำหนดให้ผู้รับจ้างและพนักงานจ้างเหมา (Outsource) และองค์การพันธมิตร เก็บรวบรวม ใช้ ประมวลผล หรือเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้าไว้เป็นความลับและมีความปลอดภัย โดยห้ามผู้รับจ้างและพนักงานจ้างเหมาดังกล่าวนำข้อมูลส่วนบุคคลของข้าพเจ้าไปใช้นอกเหนือจากที่กำหนดให้ดำเนินการตามสัญญาจ้าง และภายใต้วัตถุประสงค์ในการจัดเก็บข้อมูลส่วนบุคคลนี้',
      ],
   },
   {
      id: 6,
      heading: '5. ประเภทของบุคคลหรือหน่วยงานที่พรรคอาจเปิดเผยข้อมูลส่วนบุคคล',
      paragraphs: [
         '5.1 ผู้รับจ้างและพนักงานจ้างเหมา (Outsource) ซึ่งพรรคได้มอบหมายให้ดำเนินการประมวลผลข้อมูลส่วนบุคคลของข้าพเจ้า และหมายความรวมถึงเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของพรรคและของผู้ประมวลผลข้อมูลส่วนบุคคลด้วย',
         '5.2 องค์การพันธมิตรซึ่งร่วมกันดำเนินกิจกรรมของพรรค โดยเปิดเผยข้อมูลเท่าที่จำเป็นต่อการดำเนินกิจกรรมเพื่อประโยชน์ของพรรค',
         '5.3 ผู้ให้บริการเกี่ยวกับเทคโนโลยีสารสนเทศ การตลาด การโฆษณาประชาสัมพันธ์ การวิเคราะห์ข้อมูล สถิติ การวิจัยและพัฒนาฐานข้อมูลของพรรคในการดำเนินกิจกรรมทางการเมือง ทั้งนี้ เท่าที่จำเป็นต่อการดำเนินการตามวัตถุประสงค์ที่ข้าพเจ้าได้ยินยอมไว้',
         '5.4 เจ้าหน้าที่หรือหน่วยงานของรัฐซึ่งมีอำนาจตามกฎหมายที่ชัดแจ้ง และเป็นกรณีที่มีกฎหมายกำหนดให้พรรคต้องเปิดเผยข้อมูลต่อเจ้าหน้าที่หรือหน่วยงานของรัฐนั้น',
      ],
   },
   {
      id: 7,
      heading: '6. คำชี้แจงและสิทธิของเจ้าของข้อมูลส่วนบุคคล',
      paragraphs: [
         'พรรคขอแถลงคำชี้แจงและสิทธิของเจ้าของข้อมูลส่วนบุคคล ดังนี้',
         '6.1 พรรคจะเก็บรวบรวม ใช้ ประมวลผล หรือเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล ภายใต้วัตถุประสงค์ที่ได้จดแจ้งไว้',
         '6.2 หากภายหลังมีการเปลี่ยนแปลงวัตถุประสงค์ในการเก็บรวบรวม ใช้ ประมวลผล หรือเปิดเผยข้อมูลส่วนบุคคล พรรคจะแจ้งให้เจ้าของข้อมูลส่วนบุคคลทราบและขอความยินยอมจากเจ้าของข้อมูลส่วนบุคคล ในการนี้ พรรคจะทำการบันทึกการแก้ไขเพิ่มเติมไว้เป็นหลักฐาน',
         '6.3 เจ้าของข้อมูลส่วนบุคคลมีสิทธิตามกฎหมายดังต่อไปนี้',
         '(1) สิทธิในการแก้ไขหรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของตนเองให้มีความเป็นปัจจุบัน ถูกต้องและสมบูรณ์',
         '(2) สิทธิในการเพิกถอนความยินยอมที่ได้ให้ไว้ต่อพรรคเมื่อใดก็ได้ โดยเจ้าของข้อมูลส่วนบุคคลแจ้งความประสงค์ทางอีเมล (E-mail) ที่เจ้าของข้อมูลส่วนบุคคลได้จดแจ้งไว้ และแสดงเจตนามายังหมายเลขโทรศัพท์ของผู้ควบคุมข้อมูล',
         '(3) สิทธิในการขอระงับการเก็บรวบรวม ใช้ ประมวลผล หรือเปิดเผยข้อมูลส่วนบุคคล เฉพาะในส่วนที่เกี่ยวข้องกับข้อมูลส่วนบุคคลของตนเองอย่างชัดแจ้งเมื่อใดก็ได้ โดยเจ้าของข้อมูลส่วนบุคคลแจ้งความประสงค์ทางอีเมล (E-mail) ที่เจ้าของข้อมูลส่วนบุคคลได้จดแจ้งไว้ และแสดงเจตนามายังหมายเลขโทรศัพท์ของผู้ควบคุมข้อมูล',
         '(4) สิทธิในการขอให้พรรคลบหรือทำลายข้อมูลส่วนบุคคลเฉพาะในส่วนที่เกี่ยวกับข้อมูลส่วนบุคคลของตนเองอย่างชัดแจ้งเมื่อใดก็ได้ โดยเจ้าของข้อมูลส่วนบุคคลแจ้งความประสงค์ทางหมายเลขโทรศัพท์ที่เจ้าของข้อมูลส่วนบุคคลได้จดแจ้งไว้ และแสดงเจตนามายังหมายเลขโทรศัพท์ของผู้ควบคุมข้อมูล',
         '(5) สิทธิในการขอเข้าถึงและคัดถ่ายสำเนาข้อมูลส่วนบุคคลของตนเองโดยให้มีการรับรองสำเนาถูกต้อง หรือขอให้เปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลที่ตนไม่ได้ให้ความยินยอมโดยชัดแจ้ง',
         '(6) สิทธิในการขอรับข้อมูลส่วนบุคคลที่เกี่ยวกับตนเองจากพรรคได้ รวมทั้งขอให้พรรคส่งหรือโอนข้อมูลส่วนบุคคลไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่น หรือขอรับข้อมูลส่วนบุคคลที่พรรคส่งหรือโอนให้กับผู้ควบคุมข้อมูลส่วนบุคคลอื่น',
         '(7) สิทธิในการขอให้พรรคเปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลที่เกี่ยวกับตนเอง ในกรณีที่ตนได้ได้ให้ความยินยอมในการเก็บรวบรวม ใช้ ประมวลผล หรือเปิดเผยข้อมูลส่วนบุคคลนั้น',
         '(8) สิทธิร้องเรียนในกรณีที่พรรคหรือผู้ประมวลผลข้อมูลส่วนบุคคล ตลอดจนเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล ลูกจ้าง หรือผู้รับจ้างของพรรคฝ่าฝืนไม่ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล และประกาศที่ตราขึ้นเพื่อบังคับการให้เป็นไปตามกฎหมาย',
         'ในกรณีที่เจ้าของข้อมูลส่วนบุคคลประสงค์จะใช้สิทธิตามที่ระบุไว้ข้างต้น ขอให้ติดต่อมาที่หมายเลขโทรศัพท์หรืออีเมลของผู้ควบคุมข้อมูล',
      ],
   },
   {
      id: 8,
      heading: '7. การรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล',
      paragraphs: [
         'พรรคมีมาตรการในการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล ดังต่อไปนี้',
         '7.1 กำหนดสิทธิและข้อจำกัดการเข้าถึงข้อมูลส่วนบุคคลของพนักงานพรรค และพนักงานจ้างเหมา (Outsource) ของพรรค เพื่อแบ่งระดับความรับผิดชอบข้อมูลของท่านตั้งแต่ระดับผู้บันทึกข้อมูล จนถึงระดับผู้ดูแลระบบงาน',
         '7.2 ตรวจสอบและประเมินความเสี่ยงด้านความมั่นคงปลอดภัยของเว็บไซต์หรือระบบงานสารสนเทศทั้งหมดอย่างน้อยปีละหนึ่งครั้ง เพื่อตรวจสอบและปรับปรุงเว็บไซต์หรือระบบงานสารสนเทศให้มีความทันสมัย มีความปลอดภัยจากการคุกคามทางอิเล็กทรอนิกส์และเพิ่มมาตรการป้องกันช่องโหว่อย่างมีประสิทธิภาพ',
         '7.3 กำหนดให้มีมาตรการที่เหมาะสมสำหรับการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลที่มีลักษณะเฉพาะ เพื่อป้องกันข้อมูลส่วนบุคคลที่อาจส่งผลกระทบต่อความรู้สึก ความเชื่อ ศีลธรรมพื้นฐานของสังคมมนุษย์ อันอาจจะก่อให้เกิดความเสียหาย หรือกระทบต่อสิทธิเสรีภาพของเจ้าของข้อมูล เช่น เลขประจำตัวประชาชน เลขบัตรเครดิต-บัตรเดบิต เป็นต้น',
         '7.4 สร้างมาตรการบ่มเพาะจิตสำนึกความรับผิดชอบอย่างเคร่งครัดด้านการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลให้กับพนักงาน ลูกจ้าง หรือผู้รับจ้างของพรรค ด้วยการเผยแพร่ข่าวสาร ให้ความรู้ จัดสัมมนา หรือฝึกอบรมในด้านการสร้างความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลอย่างเคร่งครัด',
      ],
   },
   {
      id: 9,
      heading: '8. ข้อมูลเกี่ยวกับผู้ควบคุมข้อมูลส่วนบุคคลและผู้ประมวลผลข้อมูลส่วนบุคคล',
      paragraphs: [
         '8.1 ผู้ควบคุมข้อมูล : พรรคคนไทย สำนักงานใหญ่พรรคตั้งอยู่ที่ อาคารเลขที่ 167 ชั้น 4 ซอยรามคำแหง 42 แขวงหัวหมาก เขตบางกะปิ กรุงเทพมหานคร รหัสไปรษณีย์ 10240 หมายเลขโทรศัพท์ 02-038-5100 อีเมล : office@peoplespartythailand.org',
         '8.2 ผู้ประมวลผลข้อมูล : บริษัท สเปกเตอร์ ซี. จำกัด ตั้งอยู่ที่ อาคารเลขที่ 167 ช้้น 5 ซอยรามคำแหง 42 แขวงหัวหมาก เขตบางกะปิ กรุงเทพมหานคร รหัสไปรษณีย์ 10240 หมายเลขโทรศัพท์ 02-821-5878 ต่อ 106 อีเมล : legal@spectrec.in.th',
         '7.2 ตรวจสอบและประเมินความเสี่ยงด้านความมั่นคงปลอดภัยของเว็บไซต์หรือระบบงานสารสนเทศทั้งหมดอย่างน้อยปีละหนึ่งครั้ง เพื่อตรวจสอบและปรับปรุงเว็บไซต์หรือระบบงานสารสนเทศให้มีความทันสมัย มีความปลอดภัยจากการคุกคามทางอิเล็กทรอนิกส์และเพิ่มมาตรการป้องกันช่องโหว่อย่างมีประสิทธิภาพ',
         '7.3 กำหนดให้มีมาตรการที่เหมาะสมสำหรับการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลที่มีลักษณะเฉพาะ เพื่อป้องกันข้อมูลส่วนบุคคลที่อาจส่งผลกระทบต่อความรู้สึก ความเชื่อ ศีลธรรมพื้นฐานของสังคมมนุษย์ อันอาจจะก่อให้เกิดความเสียหาย หรือกระทบต่อสิทธิเสรีภาพของเจ้าของข้อมูล เช่น เลขประจำตัวประชาชน เลขบัตรเครดิต-บัตรเดบิต เป็นต้น',
         '7.4 สร้างมาตรการบ่มเพาะจิตสำนึกความรับผิดชอบอย่างเคร่งครัดด้านการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลให้กับพนักงาน ลูกจ้าง หรือผู้รับจ้างของพรรค ด้วยการเผยแพร่ข่าวสาร ให้ความรู้ จัดสัมมนา หรือฝึกอบรมในด้านการสร้างความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลอย่างเคร่งครัด',
      ],
   },
]

function PrivacyPolicy() {
   return (
      <div className="px-4 xl:w-5xl w-auto lg:w-4xl mx-auto lg:py-8 space-y-9">
         <Heading_1>นโยบายคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)</Heading_1>
         {privacyPolicies.map((privacyPolicy) => (
            <Article key={privacyPolicy.id}>
               <ArticleHeading>{privacyPolicy.heading}</ArticleHeading>
               {privacyPolicy.paragraphs.map((paragraph, index) => (
                  <ArticleParagraph key={index}>{paragraph}</ArticleParagraph>
               ))}
            </Article>
         ))}
      </div>
   )
}
export default PrivacyPolicy
