import { Activity } from "@/shared/types/activity.type";

export const activityData: Activity[] = [
  {
    id: 1,
    title: "พรรคคนไทย จัดประชุมใหญ่ภาคอีสานครั้งแรกที่มหาสารคาม!",
    subtitle: "“พรรคของคนไทย เพื่อคนไทยทุกคน”",
    date: "2025-10-10",
    location: "จังหวัดมหาสารคาม",
    image: "/images/activities/activity1.png",
    content: [
      "ถือเป็นก้าวสำคัญของพรรคการเมืองน้องใหม่ ที่ประกาศจุดยืนชัดเจน “พรรคของคนไทย เพื่อคนไทยทุกคน” บรรยากาศการประชุมเต็มไปด้วยความคึกคักและพลังแห่งความหวังจากประชาชนทั่วภาคอีสาน",
      "การประชุมใหญ่ครั้งนี้จัดขึ้นที่จังหวัดมหาสารคาม มีผู้เข้าร่วมกว่า 500 คน ประกอบด้วยผู้ก่อตั้งพรรค สมาชิก และตัวแทนจากหลายจังหวัดในภาคอีสาน พร้อมเจ้าหน้าที่จากคณะกรรมการการเลือกตั้ง (กกต.) เข้าร่วมสังเกตการณ์ เพื่อให้การดำเนินงานเป็นไปตามกฎหมายพรรคการเมืองอย่างถูกต้อง",
      "ในการประชุม มีวาระสำคัญหลายเรื่อง ทั้งการอนุมัติข้อบังคับพรรค การกำหนดอุดมการณ์และนโยบายหลัก รวมถึงการเลือกคณะกรรมการบริหารพรรคชุดแรก ซึ่งที่ประชุมมีมติเอกฉันท์ให้นายกฤษฏา เฉลิมสุข ดำรงตำแหน่ง “หัวหน้าพรรคคนไทย”",
      "นายกฤษฏากล่าวหลังได้รับตำแหน่งว่า พรรคคนไทยจะไม่เป็นเพียงพรรคทางเลือก แต่จะเป็นพรรคของ “คนทำจริง เห็นผลจริง” โดยจะมุ่งเน้นนโยบายที่จับต้องได้ แก้ปัญหาปากท้องประชาชน และยกระดับคุณภาพชีวิตของคนไทยทุกกลุ่ม",
      "เขาย้ำว่า “พรรคคนไทย” จะสื่อสารอย่างโปร่งใส ใช้สื่อดิจิทัลและช่องทางออนไลน์เป็นเครื่องมือหลักในการเข้าถึงประชาชน เพื่อให้คนไทยทุกพื้นที่ได้รับรู้ข่าวสารและเข้าใจนโยบายของพรรคอย่างแท้จริง",
      "ภายในงาน มีสมาชิกจากหลายจังหวัดในภาคอีสานเข้าร่วมอย่างคึกคัก หลายคนแสดงความพร้อมที่จะร่วมขับเคลื่อนพรรคในระดับจังหวัด เพื่อให้แนวคิดของพรรคเข้าถึงชุมชนและท้องถิ่นอย่างแท้จริง",
      "พรรคยังวางแผนลงพื้นที่อย่างต่อเนื่อง โดยเริ่มจากภาคอีสานก่อนจะขยายไปทั่วประเทศ เพื่อรับฟังเสียงสะท้อนจากประชาชนทุกอาชีพ ทั้งเกษตรกร ผู้ประกอบการ คนรุ่นใหม่ และกลุ่มแรงงาน เป้าหมายคือการออกแบบนโยบายจาก “เสียงของประชาชนจริง ๆ” ไม่ใช่จากห้องประชุมในเมืองหลวง",
      "พรรคคนไทยประกาศชัดว่า จะเป็นพรรคที่เติบโตจากฐานรากของประเทศ ให้ความสำคัญกับความเท่าเทียม ความโปร่งใส และการมีส่วนร่วมของทุกภาคส่วนในสังคม “เราจะเป็นพรรคของคนไทยทุกคน ทำงานเพื่อทุกชีวิตบนแผ่นดินนี้ เพราะเราคือพรรคคนไทย เพื่อคนไทยโดยแท้”",
    ],
  },
  {
    id: 2,
    title: "ศ.ดร.สุชาติ อุทัยวัฒน์ สนับสนุนงบประมาณโครงการ “รางวัลมรดกล้านช้าง”",
    subtitle: "ขับเคลื่อนวัฒนธรรมอีสานด้วยพลังคนไทย",
    date: "2025-10-12",
    location: "จังหวัดมหาสารคาม",
    image: "/images/activities/activity2.png",
    content: [
      "เมื่อเร็ว ๆ นี้ ศาสตราจารย์ ดร.สุชาติ อุทัยวัฒน์ หนึ่งในแกนนำ พรรคคนไทย และว่าที่ผู้สมัครสมาชิกสภาผู้แทนราษฎร จังหวัดมหาสารคาม ได้มอบงบประมาณสนับสนุนจำนวน 50,000 บาท เพื่อใช้ในการดำเนินกิจกรรม “โครงการรางวัลมรดกล้านช้าง”",
      "โครงการนี้มุ่งส่งเสริมและอนุรักษ์วัฒนธรรมท้องถิ่น พร้อมสร้างแรงบันดาลใจให้เยาวชนและประชาชนในพื้นที่ ได้ร่วมกันสืบสานภูมิปัญญาและศิลปวัฒนธรรมอันทรงคุณค่าของภาคอีสาน",
      "พรรคคนไทยขอร่วมชื่นชมและขอบคุณ ศ.ดร.สุชาติ ที่มุ่งมั่นผลักดันการพัฒนาท้องถิ่นอย่างต่อเนื่อง เพื่อยกระดับคุณภาพชีวิตของประชาชนและสร้างพลังให้กับชุมชนอย่างยั่งยืน",
    ],
  },
  {
    id: 3,
    title: "พรรคคนไทยร่วมเป็นส่วนหนึ่งในการสืบสานและยกย่องศิลปวัฒนธรรมลุ่มน้ำโขง",
    subtitle: "ร่วมแสดงความยินดีกับผู้มีผลงานดีเด่นด้านศิลปวัฒนธรรม ในงานมอบรางวัล “มรดกล้านช้าง” ที่มหาวิทยาลัยมหาสารคาม",
    date: "2025-09-30",
    location: "มหาวิทยาลัยมหาสารคาม",
    image: "/images/activities/activity3.png",
    content: [
      "พรรคคนไทยร่วมเป็นส่วนหนึ่งในการสืบสานและยกย่องศิลปวัฒนธรรมลุ่มน้ำโขง เพื่อร่วมแสดงความยินดีกับผู้มีผลงานดีเด่นด้านศิลปวัฒนธรรม ในงานมอบรางวัล “มรดกล้านช้าง” ที่มหาวิทยาลัยมหาสารคาม",
      "กิจกรรมดังกล่าวจัดขึ้นเพื่อส่งเสริมการอนุรักษ์และพัฒนาศิลปวัฒนธรรมของภูมิภาคลุ่มน้ำโขง สะท้อนถึงรากเหง้าทางวัฒนธรรมและความภาคภูมิใจของคนอีสาน",
      "พรรคคนไทยให้ความสำคัญกับการสืบสานศิลปวัฒนธรรมท้องถิ่น เพื่อเป็นพลังขับเคลื่อนสังคมอย่างยั่งยืน และสร้างแรงบันดาลใจให้คนรุ่นใหม่ร่วมอนุรักษ์ภูมิปัญญาไทย",
    ],
  }
];
