function IdeologyPage() {
   return (
      <div className="px-4 pb-4 xl:w-5xl w-auto lg:w-4xl mx-auto lg:py-8 space-y-9">
         <h1 className="text-4xl lg:text-6xl leading-[1.5] text-center lg:my-4 lg:py-8 text-ora-100 rounded-2xl">
            &ldquo;เราอยากให้ทุกคนมี เสรีภาพ เสมอภาค ภราดรภาพ&ldquo;
         </h1>

         <section className="space-y-4 mt-12">
            <div className="text-center space-y-2">
               <h1 className="text-4xl text-pur-600">แสงสว่างแห่งรุ่งอรุณ</h1>
               <h2 className="text-pur-700/70 text-xl">คำประกาศอุดมการณ์ทางการเมืองพรรคคนไทย</h2>
            </div>
            <article className="space-y-2 text-pur-700/70">
               <p>
                  <span className="text-pur-400">พรรคคนไทย</span>
                  เชื่อมั่นว่ามนุษย์มีศักยภาพในการเปลี่ยนแปลงไปสู่สิ่งที่ดีกว่า
                  มนุษย์มีสิทธิในการใฝ่ฝันถึงสังคมที่ดีกว่า และมนุษย์มีความชอบธรรมสูงสุดในการกำหนดอนาคตของตนเองและสังคม
               </p>
               <p>
                  <span className="text-pur-400">พรรคคนไทย</span> เชื่อมั่นในความเป็นไปได้ โลกยุคใหม่ สังคมใหม่
                  และการเมืองแบบใหม่ เป็นไปได้เสมอ
               </p>
               <p>
                  <span className="text-pur-400">พรรคคนไทย</span> ยืนยันหลักการประชาชนเป็นผู้ทรงอำนาจสูงสุด
                  การใช้อำนาจรัฐต้องสัมพันธ์ยึดโยงกับประชาชน
                  การดำเนินกิจกรรมของพรรคยึดหลักการมีส่วนร่วมของสมาชิกพรรคเป็นสำคัญ
                  โดยส่งเสริมประชาธิปไตยภายในพรรคพร้อมไปกับประสิทธิภาพในการทำงาน
               </p>
            </article>
         </section>

         <section className="space-y-8 mt-12">
            <div className="text-center space-y-2">
               <h1 className="text-4xl text-pur-600">วิสัยทัศน์พรรคคนไทย</h1>
               <h2 className="text-pur-700/70 text-xl">พรรคคนไทยยังคงยึดหลักการสำคัญ 3 ประการในการทำงาน</h2>
            </div>

            <article className="space-y-4 text-pur-700/70">
               <div>
                  <h2 className="text-xl text-pur-600">ประการที่ 1</h2>
                  <p className="text-xl text-pur-700/70">เป็นพรรคการเมืองที่มุ่งมั่นการทำงานการเมืองอย่างสร้างสรรค์</p>
               </div>
               <p>
                  พรรคคนไทยยังคงมุ่งมั่นที่จะเสนอนโยบายที่ก้าวหน้า สร้างการกระจายอำนาจลงสู่ท้องถิ่น
                  ทลายการผูกขาดทางเศรษฐกิจ และเปิดโอกาสให้ประชาชนสามารถเข้าถึงทุน ทรัพยากร และสวัสดิการ
                  โดยที่นโยบายของพรรคจะเกิดจาก
               </p>
               <ul className="ml-6">
                  <ol>1. การวิเคราะห์วิจัยทางวิชาการ</ol>
                  <ol>2. การมีส่วนร่วมของประชาชน ผ่านการเข้ารับฟังปัญหาในแต่ละพื้นที่โดยตรง</ol>
                  <ol>3. การศึกษาเปรียบเทียบตัวอย่างนโยบายจากต่างประเทศ</ol>
               </ul>
               <p>
                  ในการดำเนินกิจกรรมทางการเมืองนั้น
                  พรรคคนไทยมุ่งมั่นจะแข่งขันกับพรรคการเมืองอื่นในฐานะของคู่แข่งทางการเมือง ไม่ใช่ศัตรูทางการเมือง
                  พรรคคนไทยมุ่งมั่นที่จะเอาชนะใจประชาชนด้วยการนำเสนอนโยบายที่ก้าวหน้า และสร้างประโยชน์ให้แก่ประชาชน
                  ไม่ใช่การทำลายล้างกันทางการเมืองโดยไม่เลือกวิธีการ
               </p>
            </article>

            <article className="space-y-4">
               <div>
                  <h2 className="text-xl text-pur-600">ประการที่ 2</h2>
                  <p className="text-xl text-pur-700/70">เป็นพรรคการเมืองของประชาชน</p>
               </div>
               <p>
                  พรรคคนไทยยังคงมุ่งมั่นที่จะเสนอนโยบายที่ก้าวหน้า สร้างการกระจายอำนาจลงสู่ท้องถิ่น
                  ทลายการผูกขาดทางเศรษฐกิจ และเปิดโอกาสให้ประชาชนสามารถเข้าถึงทุน ทรัพยากร และสวัสดิการ
                  โดยที่นโยบายของพรรคจะเกิดจาก
               </p>
               <p>
                  พรรคคนไทย มีสมาชิกพรรคทุกคนเป็นเจ้าของพรรคร่วมกัน
                  โดยแสดงออกผ่านการมีส่วนร่วมของสมาชิกพรรคทั้งในแง่ของการระดมทุน และการตัดสินใจทางการเมือง
                  ทั้งนี้ในส่วนการระดมทุนจากสมาชิกและผู้สนับสนุน เราจะเดินทางไปจัดกิจกรรมทั่วประเทศ
                  ด้วยกิจกรรมหลายรูปแบบ
               </p>
               <p>
                  และด้วยการดำเนินกิจกรรมของพรรคคนไทยที่อาศัยทรัพยากรจากการระดมทุนจากสมาชิกพรรคและผู้สนับสนุนพรรคนี้
                  จะทำให้ความสัมพันธ์ระหว่างพรรค กรรมการบริหารพรรค กับสมาชิกพรรค ไม่ตั้งอยู่บนฐานของ ‘เจ้านาย-ลูกน้อง’
                  แต่ทุกคนต่างก็มีส่วน มีความเป็นเจ้าของพรรคการเมืองนี้ร่วมกัน
               </p>
               <p>
                  ผู้บริหารพรรคเพียงไม่กี่คนจึงไม่อาจจะกำหนดความเป็นไปของพรรคได้
                  ไม่อาจกำหนดตัวผู้สมัครสมาชิกสภาผู้แทนราษฎร (ส.ส.) ได้ตามอำเภอใจ และที่สำคัญคือ เงินที่ได้จากการระดมทุน
                  รายรับ รายจ่าย จะถูกนำมาเปิดเผยต่อสมาชิกพรรคเพื่อสร้างความโปร่งใส และเปิดโอกาสให้มีการตรวจสอบได้
               </p>
               <p>
                  เมื่อสมาชิกพรรคทุกคนเป็นเจ้าของพรรคร่วมกันแล้ว สมาชิกทุกคนย่อมมีอำนาจในการตัดสินใจ
                  มีส่วนร่วมในการกำหนดทิศทางของพรรค
                  ตามการออกแบบโครงสร้างและการดำเนินการที่อยู่บนพื้นฐานของหลักการประชาธิปไตย การมีส่วนร่วม
                  และการกระจายอำนาจ
               </p>
            </article>

            <article className="space-y-4">
               <div>
                  <h2 className="text-xl text-pur-600">ประการที่ 3</h2>
                  <p className="text-xl text-pur-700/70">เป็นพรรคการเมืองที่มุ่งการทำงานการเมืองระยะยาว</p>
               </div>
               <p>
                  พรรคคนไทยไม่ใช่พรรคการเมืองเฉพาะกิจที่มุ่งหมายทำงานเฉพาะการเลือกตั้งเป็นครั้งๆไป
                  หากแต่ยังรับสืบทอดอุดมการณ์มาจากพรรคอนาคตใหม่ที่ถูกยุบ
                  แน่นอนว่าการเลือกตั้งเป็นพื้นที่สำคัญในการรณรงค์ทางการเมือง
                  เป็นกลไกสำคัญในการทำให้พรรคการเมืองได้เข้าสู่อำนาจรัฐเพื่อผลักดันนโยบายให้เกิดผล
                  แต่การเลือกตั้งก็ไม่ใช่ทั้งหมดของการเมือง
               </p>
               <p>
                  พรรคคนไทยจะเป็นพรรคการเมืองที่มีชีวิตตลอดเวลา
                  ไม่ใช่จะขยันหรือกระตือรือร้นทำงานเฉพาะในช่วงฤดูกาลเลือกตั้งเท่านั้น
                  แต่เราจะทำงานอย่างต่อเนื่องไม่มีวันหยุด
               </p>
               <p>
                  เมื่อมีการเลือกตั้งพรรคคนไทยจะส่งผู้สมัครรับเลือกตั้งลงแข่งขัน
                  และจะทำงานรณรงค์ทางการเมืองอย่างไม่รู้จักเหน็ดเหนื่อย
                  เพื่อเข้าไปใช้อำนาจทางการเมืองในการเปลี่ยนแปลงประเทศ
                  เราต้องการมีอำนาจมิใช่เพื่อนำอำนาจมาใช้สนองประโยชน์ส่วนตัว แต่เราจำเป็นต้องมีอำนาจ
                  เพื่อคืนอำนาจให้ถึงมือประชาชน
               </p>
               <p>
                  เมื่อผ่านการเลือกตั้งแล้ว
                  สมาชิกพรรคที่เข้าสู่ตำแหน่งทางการเมืองก็จะปฏิบัติหน้าที่ของตนไปอย่างเต็มความสามารถ
                  ส่วนพรรคคนไทยก็จะต้องทำงานอย่างต่อเนื่อง ทั้งการจัดหลักสูตร “ห้องเรียนประชาชน”
                  เพื่อเผยแพร่ความรู้และหลักการประชาธิปไตย พร้อมทั้งทำงานเชิงประเด็นในพื้นที่อย่างแข็งขันและต่อเนื่อง
               </p>
               <p>
                  เราจะสร้างพรรคที่ทันสมัยและเป็นมิตรต่อทุกคน เป็นพื้นที่สำหรับการใช้สอยร่วมกัน จัดกิจกรรมให้กับเยาวชน
                  นิสิต นักศึกษา ได้มาพบปะพูดคุยกัน
               </p>
            </article>

            <p className="text-pur-600 text-xl">
               ทั้งหมดนี้คือแนวทางของพรรคคนไทย ซึ่งการดำเนินการตามแนวทางนี้จะทำให้พรรคคนไทยสามารถ ‘ปักธง’ และ
               ‘ชิงพื้นที่’ เพื่อเปลี่ยนภูมิทัศน์การเมืองไทย รวมถึง ‘สานต่อ’ อุดมการณ์และภารกิจของพรรคคนไทย
            </p>
         </section>
      </div>
   )
}
export default IdeologyPage
